Masmiseim36/nxpSDK/devices/MIMXRT1166/drivers/fsl_enet.c
    /* Check the data length. */
    if (handle->txBuffSizeAlign[ringId] < length)
    {
        result = kStatus_ENET_TxFrameOverLen;
    }
    /* Check txDirtyRing if need frameinfo in tx interrupt callback. */
    else if (handle->TxReclaimEnable[ringId] && !ENET_TxDirtyRingAvailable(txDirtyRing))
    {
        result = kStatus_ENET_TxFrameBusy;
    }
    else
    {
        /* Check if the transmit buffer is ready or ring with framinfo is full. */
        curBuffDescrip = txBdRing->txBdBase + txBdRing->txGenIdx;
        if (0U != (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_READY_MASK))
        {
            result = kStatus_ENET_TxFrameBusy;
        }
        else
        {
            /* Prepare data address for uDMA transfer. */
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            data = (uint8_t *)MEMORY_ConvertMemoryMapAddress((uint32_t)data, kMEMORY_Local2DMA);
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
            curBuffDescrip->buffer = (uint8_t *)(uint32_t)data;

            /* Set data length. */
            curBuffDescrip->length = (uint16_t)length;
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
            /* For enable the timestamp. */
            if ((txFlag & ENET_TX_TIMESTAMP_FLAG) != 0U)
            {
                curBuffDescrip->controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_TIMESTAMP_MASK;
            }
            else
            {
                curBuffDescrip->controlExtend1 &= (uint16_t)(~ENET_BUFFDESCRIPTOR_TX_TIMESTAMP_MASK);
            }

#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */

            if (handle->TxReclaimEnable[ringId])
            {
                primask = DisableGlobalIRQ();
                txBdRing->txDescUsed++;
                EnableGlobalIRQ(primask);
            }
            /* If BD is full or last flag sets, send out all data */
            if ((txFlag & ENET_TX_LAST_BD_FLAG) != 0U)
            {
                /* Set all configurated BDs with own flag ready */
                tempBuffDescrip = curBuffDescrip;
                index           = txBdRing->txGenIdx;
                do
                {
                    if ((tempBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_SOFTOWENER1_MASK) != 0U)
                    {
                        tempBuffDescrip->control &= (uint16_t)(~ENET_BUFFDESCRIPTOR_TX_SOFTOWENER1_MASK);
                        tempBuffDescrip->control |= ENET_BUFFDESCRIPTOR_TX_READY_MASK;
                    }
                    index           = ENET_IncreaseIndex(index, txBdRing->txRingLen);
                    tempBuffDescrip = txBdRing->txBdBase + index;
                } while (tempBuffDescrip != curBuffDescrip);

                /* Add context to frame info ring */
                if (handle->TxReclaimEnable[ringId])
                {
                    txDirty               = txDirtyRing->txDirtyBase + txDirtyRing->txGenIdx;
                    txDirty->context      = context;
                    txDirtyRing->txGenIdx = ENET_IncreaseIndex(txDirtyRing->txGenIdx, txDirtyRing->txRingLen);
                    if (txDirtyRing->txGenIdx == txDirtyRing->txConsumIdx)
                    {
                        txDirtyRing->isFull = true;
                    }
                }

                curBuffDescrip->control |= (ENET_BUFFDESCRIPTOR_TX_READY_MASK | ENET_BUFFDESCRIPTOR_TX_LAST_MASK);

                /* Active the transmit buffer descriptor. */
                ENET_ActiveSend(base, 0);
            }
            else
            {
                curBuffDescrip->control &= (uint16_t)(~ENET_BUFFDESCRIPTOR_TX_LAST_MASK);
                /* Set owner flag, need to set Tx ready for all BDs with this flag after configurating last BD */
                curBuffDescrip->control |= ENET_BUFFDESCRIPTOR_TX_SOFTOWENER1_MASK;
            }

            /* Increase the buffer descriptor address. */
            txBdRing->txGenIdx = ENET_IncreaseIndex(txBdRing->txGenIdx, txBdRing->txRingLen);
        }
    }

    /* If fails to send whole frame success, need to send out all left ready data in BDs, make sure. */
    if (result != kStatus_Success)
    {
        tempBuffDescrip = txBdRing->txBdBase + txBdRing->txGenIdx;
        index           = txBdRing->txGenIdx;
        do
        {
            if ((tempBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_SOFTOWENER1_MASK) != 0U)
            {
                tempBuffDescrip->control &= (uint16_t)(~ENET_BUFFDESCRIPTOR_TX_SOFTOWENER1_MASK);
                tempBuffDescrip->control |= ENET_BUFFDESCRIPTOR_TX_READY_MASK;
            }
            index           = ENET_IncreaseIndex(index, txBdRing->txRingLen);
            tempBuffDescrip = txBdRing->txBdBase + index;
        } while (index != txBdRing->txGenIdx);
    }

    return result;
}

/*!
 * brief Adds the ENET device to a multicast group.
 *
 * param base    ENET peripheral base address.
 * param address The six-byte multicast group address which is provided by application.
 */
void ENET_AddMulticastGroup(ENET_Type *base, uint8_t *address)
{
    assert(address != NULL);

    enet_handle_t *handle = s_ENETHandle[ENET_GetInstance(base)];
    uint32_t crc          = 0xFFFFFFFFU;
    uint32_t count1       = 0;
    uint32_t count2       = 0;
    uint32_t configVal    = 0;

    /* Calculates the CRC-32 polynomial on the multicast group address. */
    for (count1 = 0; count1 < ENET_FRAME_MACLEN; count1++)
    {
        uint8_t c = address[count1];
        for (count2 = 0; count2 < 0x08U; count2++)
        {
            if (0U != ((c ^ crc) & 1U))
            {
                crc >>= 1U;
                c >>= 1U;
                crc ^= 0xEDB88320U;
            }
            else
            {
                crc >>= 1U;
                c >>= 1U;
            }
        }
    }

    crc = crc >> 26U;

    handle->multicastCount[crc]++;

    /* Enable a multicast group address. */
    configVal = (1U << (crc & 0x1FU));

    if (0U != (crc & 0x20U))
    {
        base->GAUR |= configVal;
    }
    else
    {
        base->GALR |= configVal;
    }
}

/*!
 * brief Moves the ENET device from a multicast group.
 *
 * param base  ENET peripheral base address.
 * param address The six-byte multicast group address which is provided by application.
 */
void ENET_LeaveMulticastGroup(ENET_Type *base, uint8_t *address)
{
    assert(address != NULL);

    enet_handle_t *handle = s_ENETHandle[ENET_GetInstance(base)];
    uint32_t crc          = 0xFFFFFFFFU;
    uint32_t count1       = 0;
    uint32_t count2       = 0;
    uint32_t configVal    = 0;

    /* Calculates the CRC-32 polynomial on the multicast group address. */
    for (count1 = 0; count1 < ENET_FRAME_MACLEN; count1++)
    {
        uint8_t c = address[count1];
        for (count2 = 0; count2 < 0x08U; count2++)
        {
            if (0U != ((c ^ crc) & 1U))
            {
                crc >>= 1U;
                c >>= 1U;
                crc ^= 0xEDB88320U;
            }
            else
            {
                crc >>= 1U;
                c >>= 1U;
            }
        }
    }

    crc = crc >> 26U;

    handle->multicastCount[crc]--;

